Repository: Fluently-Grad-Project/Backend
Catalog: app/core/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Invalid credentials
ar: بياناتك غير صحيحة

source: User account is locked
ar: تم قفل حساب المستخدم

source: Email not verified
ar: البريد الإلكتروني غير مفعل

source: An error occurred while processing your request. Please try again later
ar: حدث خطأ أثناء معالجة طلبك. يرجى المحاولة مرة أخرى لاحقًا

source: An unexpected error occurred. Please try again later
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا

source: User not found
ar: المستخدم غير موجود

source: Invalid verification code
ar: رمز التحقق غير صالح

source: Verification code expired
ar: انتهت صلاحية رمز التحقق

source: Email verified successfully
ar: تم التحقق من البريد الإلكتروني بنجاح.

source: Password reset code generated successfully
ar: تم إنشاء رمز إعادة تعيين كلمة المرور بنجاح

source: Password reset successfully
ar: تمت إعادة تعيين كلمة المرور بنجاح

source: Invalid refresh token
ar: رمز التحديث غير صالح

source: Refresh token is invalid or expired
ar: رمز التحديث غير صالح أو منتهي الصلاحية

source: Email and password are required
ar: البريد الإلكتروني وكلمة المرور مطلوبة

source: Email is required
ar: البريد الإلكتروني مطلوب

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

source: Password must be at least 8 characters, one uppercase, one lowercase, one special character
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل، وحرف كبير واحد، وحرف صغير واحد، وحرف خاص واحد

source: User with ID {user_id} not found
ar: المستخدم بالمعرف {user_id} غير موجود

source: User with ID {user_id} is suspended
ar: المستخدم بالمعرف {user_id} موقوف

source: Cannot send friend request to yourself
ar: لا يمكنك إرسال طلب صداقة إلى نفسك

source: Users are already friends
ar: المستخدمون أصدقاء بالفعل

source: Friend request already sent
ar: تم إرسال طلب الصداقة بالفعل

source: This user has already sent you a friend request
ar: هذا المستخدم أرسل لك بالفعل طلب صداقة

source: Friend request sent successfully
ar: تم إرسال طلب الصداقة بنجاح

source: No pending friend request found
ar: لا يوجد طلب صداقة معلق

source: Friend request accepted successfully
ar: تم قبول طلب الصداقة بنجاح

source: Friend request rejected successfully
ar: تم رفض طلب الصداقة بنجاح
